<center><h1>Cookbook</h1></center>

1. Idioms
    - if-then
    - Splitting
    - Building Criteria
2. Selection
    - DataFrames
    - Panels
    - New Columns
3. MultiIndexing
    - Arithmetic
    - Slicing
    - Sorting
    - Levels
    - paneInd
4. Missing Data
    - Replace
5. Grouping
    - Expanding Data
    - Splitting
    - Pivot
    - Apply
6. Timeseries
    - Resampling
7. Merge
8. Plotting
9. Data In/Out
    - csv
    - Sql
    - Excel
    - HDFStore
    - BInary Files

In [1]:
%matplotlib inline

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

# 1 Idioms
---
- if-then
- Splitting
- Building Criteria

In [2]:
df = pd.DataFrame({
    'AAA': [4, 5, 6, 7],
    'BBB': [10, 20, 30, 40],
    'CCC': [100, 50, -30, -50]
})
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

> if-then

---

In [6]:
df.loc[df.AAA >= 5, 'BBB'] = -1
df

   AAA  BBB  CCC
0    4   10  100
1    5   -1   50
2    6   -1  -30
3    7   -1  -50

In [14]:
df.loc[df.AAA >= 5, ['BBB', 'CCC']] = -1
df

   AAA  BBB  CCC
0    4   10  100
1    5   -1   -1
2    6   -1   -1
3    7   -1   -1

In [15]:
df_mask = pd.DataFrame({
    'AAA': [True] * 4,
    'BBB': [False] * 4,
    'CCC': [True, False] * 2
})
df.where(df_mask, -1000)

   AAA   BBB   CCC
0    4 -1000   100
1    5 -1000 -1000
2    6 -1000    -1
3    7 -1000 -1000

In [16]:
df = pd.DataFrame({
    'AAA': [4, 5, 6, 7],
    'BBB': [10, 20, 30, 40],
    'CCC': [100, 50, -30, -50]
})
df['logic'] = np.where(df['AAA'] > 5, 'high', 'low')
df

   AAA  BBB  CCC logic
0    4   10  100   low
1    5   20   50   low
2    6   30  -30  high
3    7   40  -50  high

> Splitting

---

In [27]:
df = pd.DataFrame({
    'AAA': [4, 5, 6, 7],
    'BBB': [10, 20, 30, 40],
    'CCC': [100, 50, -30, -50]
})
# dflow = df[df.AAA <= 5]
dflow = df[df['AAA'] <= 5]
dflow

   AAA  BBB  CCC
0    4   10  100
1    5   20   50

In [19]:
dfhigh = df[df.AAA > 5]
dfhigh

   AAA  BBB  CCC
2    6   30  -30
3    7   40  -50

> Building Criteria

---

In [34]:
df = pd.DataFrame({
    'AAA': [4, 5, 6, 7],
    'BBB': [10, 20, 30, 40],
    'CCC': [100, 50, -30, -50]
})
newseries = df.loc[(df['BBB'] < 25) & (df['CCC'] >= 40), ['AAA', 'BBB']]
newseries

   AAA  BBB
0    4   10
1    5   20

    use argsort

In [55]:
df.loc[(df.BBB > 25) | (df.CCC > 70), 'AAA'] = 0.1

In [70]:
aValue = 43.0
df.loc[(df.CCC - aValue).abs().argsort()]

   AAA  BBB  CCC
1  5.0   20   50
0  0.1   10  100
2  0.1   30  -30
3  0.1   40  -50

    use a binary operation
    ---

In [76]:
df = pd.DataFrame({
    'AAA': [4, 5, 6, 7],
    'BBB': [10, 20, 30, 40],
    'CCC': [100, 50, -30, -50]
})

crit1 = df.AAA <= 5.5
crit2 = df.BBB == 10.0
crit3 = df.CCC > -40

In [77]:
allCrit = crit1 & crit2 & crit3

In [81]:
critList = [crit1, crit2, crit3]
critList

[0     True
 1     True
 2    False
 3    False
 Name: AAA, dtype: bool, 0     True
 1    False
 2    False
 3    False
 Name: BBB, dtype: bool, 0     True
 1     True
 2     True
 3    False
 Name: CCC, dtype: bool]

In [88]:
df[allCrit]

   AAA  BBB  CCC
0    4   10  100

# 2 Selection
---
- DataFrames
- Panels
- New Columns

## 2.1 DataFrames
---

In [127]:
df = pd.DataFrame({
    'AAA': [4, 5, 6, 7],
    'BBB': [10, 20, 30, 40],
    'CCC': [100, 50, -30, -50]
})

In [128]:
df[(df.AAA <= 6) & (df.index.isin([0,2,4]))]

   AAA  BBB  CCC
0    4   10  100
2    6   30  -30

In [129]:
data = {
    'AAA': [4, 5, 6, 7],
    'BBB': [10, 20, 30, 40],
    'CCC': [100, 50, -30, -50]
}
df = pd.DataFrame(data=data, index=['foo','bar','boo','kar'])
df

     AAA  BBB  CCC
foo    4   10  100
bar    5   20   50
boo    6   30  -30
kar    7   40  -50

In [132]:
df.loc['foo']

AAA      4
BBB     10
CCC    100
Name: foo, dtype: int64

In [133]:
df.iloc[0]

AAA      4
BBB     10
CCC    100
Name: foo, dtype: int64

In [125]:
df2 = pd.DataFrame(data=data, index=[1,2,3,4])
df2.iloc[1:3]

   AAA  BBB  CCC
2    5   20   50
3    6   30  -30

In [126]:
df2.loc[1:3]

   AAA  BBB  CCC
1    4   10  100
2    5   20   50
3    6   30  -30

In [135]:
df = pd.DataFrame({
    'AAA': [4, 5, 6, 7],
    'BBB': [10, 20, 30, 40],
    'CCC': [100, 50, -30, -50]
})
df[~((df.AAA <= 6) & (df.index.isin([0,2,4])))]

   AAA  BBB  CCC
1    5   20   50
3    7   40  -50

## 2.2 Panels
---

In [147]:
rng = pd.date_range('1/1/2013', periods=100, freq='D')
data = np.random.randn(100, 4)
cols = ['A', 'B', 'C', 'D']
df1, df2, df3 = pd.DataFrame(data, rng, cols), \
                pd.DataFrame(data, rng, cols),\
                pd.DataFrame(data, rng, cols)
pf = pd.Panel({'df1': df1, 'df2': df2, 'df3': df3})
pf

<class 'pandas.core.panel.Panel'>
Dimensions: 3 (items) x 100 (major_axis) x 4 (minor_axis)
Items axis: df1 to df3
Major_axis axis: 2013-01-01 00:00:00 to 2013-04-10 00:00:00
Minor_axis axis: A to D

In [148]:
pf = pf.transpose(2, 0, 1)
pf

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 3 (major_axis) x 100 (minor_axis)
Items axis: A to D
Major_axis axis: df1 to df3
Minor_axis axis: 2013-01-01 00:00:00 to 2013-04-10 00:00:00

In [149]:
pf['E'] = pd.DataFrame(data, rng, cols)
pf

<class 'pandas.core.panel.Panel'>
Dimensions: 5 (items) x 3 (major_axis) x 100 (minor_axis)
Items axis: A to E
Major_axis axis: df1 to df3
Minor_axis axis: 2013-01-01 00:00:00 to 2013-04-10 00:00:00

In [150]:
pf = pf.transpose(1,2,0)
pf

<class 'pandas.core.panel.Panel'>
Dimensions: 3 (items) x 100 (major_axis) x 5 (minor_axis)
Items axis: df1 to df3
Major_axis axis: 2013-01-01 00:00:00 to 2013-04-10 00:00:00
Minor_axis axis: A to E

In [151]:
pf.loc[:, :, 'F'] = pd.DataFrame(data, rng, cols)
pf

<class 'pandas.core.panel.Panel'>
Dimensions: 3 (items) x 100 (major_axis) x 6 (minor_axis)
Items axis: df1 to df3
Major_axis axis: 2013-01-01 00:00:00 to 2013-04-10 00:00:00
Minor_axis axis: A to F

## 2.3 New Columns
---

    applymap()

In [154]:
df = pd.DataFrame({
    'AAA': [1,2,1,3],
    'BBB': [1,1,2,2],
    'CCC': [2,1,3,1]
})
source_cols = df.columns
new_cols = [str(x) + '_cat' for x in source_cols]
categories = {
    1: 'Alpha',
    2: 'Beta',
    3: 'Charlie'
}
df[new_cols] = df[source_cols].applymap(categories.get)
df

   AAA  BBB  CCC  AAA_cat BBB_cat  CCC_cat
0    1    1    2    Alpha   Alpha     Beta
1    2    1    1     Beta   Alpha    Alpha
2    1    2    3    Alpha    Beta  Charlie
3    3    2    1  Charlie    Beta    Alpha

    min() with groupby

In [160]:
df = pd.DataFrame({
    'AAA': [1,1,1,2,2,2,3,3,],
    'BBB': [2,1,3,4,5,1,2,3]
})
df.loc[df.groupby('AAA')['BBB'].idxmin()]

   AAA  BBB
1    1    1
5    2    1
6    3    2

In [170]:
df.sort_values(by='BBB').groupby('AAA', as_index=False).first()

   AAA  BBB
0    1    1
1    2    1
2    3    2

# 3 MultiIndexing
---
- Arithmetic
- Slicing
- Sorting
- Levels
- paneInd

In [191]:
df = pd.DataFrame({
    'row': [0,1,2],
    'One_X': [1.1,1.1,1.1],
    'One_Y': [1.2] * 3,
    'Two_X': [1.11] * 3,
    'Two_Y': [1.12] * 3
})
df

   One_X  One_Y  Two_X  Two_Y  row
0    1.1    1.2   1.11   1.12    0
1    1.1    1.2   1.11   1.12    1
2    1.1    1.2   1.11   1.12    2

In [192]:
df = df.set_index('row')
df

     One_X  One_Y  Two_X  Two_Y
row
0      1.1    1.2   1.11   1.12
1      1.1    1.2   1.11   1.12
2      1.1    1.2   1.11   1.12

In [193]:
# df.columns = pd.MultiIndex.from_tuples([tuple(c.split('_')) for c in df.columns])
df.columns = \
    pd.MultiIndex.from_tuples([tuple(c.split('_')) for c in df.columns])

In [194]:
df

     One        Two
       X    Y     X     Y
row
0    1.1  1.2  1.11  1.12
1    1.1  1.2  1.11  1.12
2    1.1  1.2  1.11  1.12

In [210]:
df = df.stack(0).reset_index(1)

In [ ]:
df.stack(0).reset_index

In [213]:
df.columns = ['Sample', 'All_X', 'All_Y']
df

    Sample  All_X  All_Y
row
0      One   1.10   1.20
0      Two   1.11   1.12
1      One   1.10   1.20
1      Two   1.11   1.12
2      One   1.10   1.20
2      Two   1.11   1.12

## 3.1 Arithmetic
---

In [223]:
cols = pd.MultiIndex.from_tuples([(x, y) for x in 'ABC' for y in 'OI'])
df = pd.DataFrame(np.random.randn(2, 6), index=['n', 'm'], columns=cols)
df

          A                   B                   C
          O         I         O         I         O         I
n -0.027604  1.372351  0.035978 -1.153777 -0.072078  1.289785
m  0.176335 -0.698514  1.355541  0.310447  0.268424 -0.602271

In [224]:
df = df.div(df['C'], level=1)
df

          A                   B              C
          O         I         O         I    O    I
n  0.382970  1.064015 -0.499156 -0.894550  1.0  1.0
m  0.656925  1.159801  5.049993 -0.515461  1.0  1.0

In [247]:
pp = pd.DataFrame([[1,2],[1,1]])
other = pd.DataFrame([[0.01, 0.01],[0.01, 0.01]], columns=['O','I'], index=['n', 'm'])
df.div(other, level=1)

           A                       B                 C
           O           I           O          I      O      I
n  38.297011  106.401544  -49.915577 -89.455038  100.0  100.0
m  65.692524  115.980068  504.999269 -51.546128  100.0  100.0

## 3.2 Slicing
---

In [248]:
coords = [
    ('AA', 'one'),
    ('AA', 'six'),
    ('BB', 'one'),
    ('BB', 'two'),
    ('BB', 'six')
]

index = pd.MultiIndex.from_tuples(coords)
df = pd.DataFrame([11,22,33,44,55], index, ['MyData'])
df

        MyData
AA one      11
   six      22
BB one      33
   two      44
   six      55

In [250]:
df.xs('BB', level=0, axis=0)

     MyData
one      33
two      44
six      55

In [252]:
df.xs('six', level=1)

    MyData
AA      22
BB      55

In [264]:
import itertools
index = \
    list(itertools.product(['Ada','Quinn','Violet'],['Comp','Math','Sci']))
header = list(itertools.product(['Exams', 'Labs'], ['I', 'II']))
indx = pd.MultiIndex.from_tuples(index, names=['Student', 'Course'])
clos = pd.MultiIndex.from_tuples(header)

data = [[70+x+y+(x*y)%3 for x in range(4)] for y in range(9)]

df = pd.DataFrame(data, indx, clos)
df

               Exams     Labs
                   I  II    I  II
Student Course
Ada     Comp      70  71   72  73
        Math      71  73   75  74
        Sci       72  75   75  75
Quinn   Comp      73  74   75  76
        Math      74  76   78  77
        Sci       75  78   78  78
Violet  Comp      76  77   78  79
        Math      77  79   81  80
        Sci       78  81   81  81

In [265]:
ALL = slice(None)
ALL

slice(None, None, None)

In [268]:
df.loc['Violet']

       Exams     Labs
           I  II    I  II
Course
Comp      76  77   78  79
Math      77  79   81  80
Sci       78  81   81  81

In [271]:
df.loc[(ALL, 'Math'), ALL]

               Exams     Labs
                   I  II    I  II
Student Course
Ada     Math      71  73   75  74
Quinn   Math      74  76   78  77
Violet  Math      77  79   81  80

In [272]:
df

               Exams     Labs
                   I  II    I  II
Student Course
Ada     Comp      70  71   72  73
        Math      71  73   75  74
        Sci       72  75   75  75
Quinn   Comp      73  74   75  76
        Math      74  76   78  77
        Sci       75  78   78  78
Violet  Comp      76  77   78  79
        Math      77  79   81  80
        Sci       78  81   81  81

In [278]:
df.xs('Math', level=1).loc[['Ada','Quinn']]

        Exams     Labs
            I  II    I  II
Student
Ada        71  73   75  74
Quinn      74  76   78  77

In [279]:
df.loc[(slice('Ada','Quinn'), 'Math'),ALL]

               Exams     Labs
                   I  II    I  II
Student Course
Ada     Math      71  73   75  74
Quinn   Math      74  76   78  77

In [286]:
df.loc[(ALL,'Math'),'Exams']

                 I  II
Student Course
Ada     Math    71  73
Quinn   Math    74  76
Violet  Math    77  79

In [287]:
df.loc[(ALL,'Math'),(ALL,'II')]

               Exams Labs
                  II   II
Student Course
Ada     Math      73   74
Quinn   Math      76   77
Violet  Math      79   80

## 3.3 Sorting
---

In [288]:
df.sort_values(by=('Labs','II'), ascending=False)

               Exams     Labs
                   I  II    I  II
Student Course
Violet  Sci       78  81   81  81
        Math      77  79   81  80
        Comp      76  77   78  79
Quinn   Sci       75  78   78  78
        Math      74  76   78  77
        Comp      73  74   75  76
Ada     Sci       72  75   75  75
        Math      71  73   75  74
        Comp      70  71   72  73

## 3.4 Levels
---

## 3.5 paneInd
---

# 4 Missing Data
---
- Replace

In [291]:
index = pd.date_range('2013-08-01', periods=6, freq='B')
cols = ['A']
data = np.random.randn(6, 1)
df = pd.DataFrame(data, index, cols)

                   A
2013-08-01  0.702417
2013-08-02 -0.431294
2013-08-05 -1.127570
2013-08-06 -0.156248
2013-08-07 -0.514211
2013-08-08  0.134037

In [298]:
df.reindex(df.index[::-1]).ffill()

                   A
2013-08-08  0.134037
2013-08-07 -0.514211
2013-08-06 -0.156248
2013-08-05 -1.127570
2013-08-02 -0.431294
2013-08-01  0.702417

In [299]:
df

                   A
2013-08-01  0.702417
2013-08-02 -0.431294
2013-08-05 -1.127570
2013-08-06 -0.156248
2013-08-07 -0.514211
2013-08-08  0.134037

## 4.1 Replace
---

# 5 Grouping
---
- Expanding Data
- Splitting
- Pivot
- Apply

In [301]:
df = pd.DataFrame({
    'animal': 'cat dog cat fish dog cat cat'.split(),
    'size': list('SSMMMLL'),
    'weight': [8, 10, 11, 1, 20, 12, 12],
    'adult' : [False] * 5 + [True] * 2
})
df

   adult animal size  weight
0  False    cat    S       8
1  False    dog    S      10
2  False    cat    M      11
3  False   fish    M       1
4  False    dog    M      20
5   True    cat    L      12
6   True    cat    L      12

In [308]:
df.groupby('animal').apply(lambda subf:subf['size'][subf['weight'].idxmax()])

animal
cat     L
dog     M
fish    M
dtype: object

In [318]:
gb = df.groupby(['animal'])
gb.get_group('cat')

   adult animal size  weight
0  False    cat    S       8
2  False    cat    M      11
5   True    cat    L      12
6   True    cat    L      12

In [323]:
df[df['size'] == 'S']

   adult animal size  weight
0  False    cat    S       8
1  False    dog    S      10

In [325]:
def GrowUp(x):
    avg_weight =  sum(x[x['size'] == 'S'].weight * 1.5)
    avg_weight += sum(x[x['size'] == 'M'].weight * 1.25)
    avg_weight += sum(x[x['size'] == 'L'].weight)
    avg_weight /= len(x)
    return pd.Series(['L',avg_weight,True], index=['size', 'weight', 'adult'])

expected_df = gb.apply(GrowUp)
expected_df

       size   weight  adult
animal
cat       L  12.4375   True
dog       L  20.0000   True
fish      L   1.2500   True

    transform
    ---

In [345]:
df = pd.DataFrame({'A' : [1, 1, 2, 2], 'B' : [1, -1, 1, 2]})
# print(df)
def replace(g):
    mask = g < 0
    g.loc[mask] = g[~mask].mean()
    return g
gb = df.groupby('A')
gb.transform(replace)

     B
0  1.0
1  1.0
2  1.0
3  2.0

    sort group

In [351]:
df = pd.DataFrame({
    'code': ['foo', 'bar', 'baz'] * 2,
    'data': [0.16, -0.21, 0.33, 0.45, -0.59, 0.62],
    'flag': [False, True] * 3
})

code_group = df.groupby('code')
agg = code_group[['data']].transform(sum).sort_values(by='data')
df.loc[agg.index]

  code  data   flag
1  bar -0.21   True
4  bar -0.59  False
0  foo  0.16  False
3  foo  0.45   True
2  baz  0.33  False
5  baz  0.62   True

> Create multiple aggregated columns

In [353]:
rng = pd.date_range('07/10/2014', periods=10, freq='2min')
rng

DatetimeIndex(['2014-07-10 00:00:00', '2014-07-10 00:02:00',
               '2014-07-10 00:04:00', '2014-07-10 00:06:00',
               '2014-07-10 00:08:00', '2014-07-10 00:10:00',
               '2014-07-10 00:12:00', '2014-07-10 00:14:00',
               '2014-07-10 00:16:00', '2014-07-10 00:18:00'],
              dtype='datetime64[ns]', freq='2T')

In [356]:
ts = pd.Series(list(range(10)), index = rng)

def MyCust(x):
    if len(x) > 2:
        return x[1] * 1.234
    return pd.NaT

mhc = {
    'Mean': np.mean,
    'Max': np.max,
    'Custom': MyCust
}
ts.resample('5min').apply(mhc)

Custom  2014-07-10 00:00:00    1.234
        2014-07-10 00:05:00      NaT
        2014-07-10 00:10:00    7.404
        2014-07-10 00:15:00      NaT
Max     2014-07-10 00:00:00        2
        2014-07-10 00:05:00        4
        2014-07-10 00:10:00        7
        2014-07-10 00:15:00        9
Mean    2014-07-10 00:00:00        1
        2014-07-10 00:05:00      3.5
        2014-07-10 00:10:00        6
        2014-07-10 00:15:00      8.5
dtype: object

In [357]:
ts

2014-07-10 00:00:00    0
2014-07-10 00:02:00    1
2014-07-10 00:04:00    2
2014-07-10 00:06:00    3
2014-07-10 00:08:00    4
2014-07-10 00:10:00    5
2014-07-10 00:12:00    6
2014-07-10 00:14:00    7
2014-07-10 00:16:00    8
2014-07-10 00:18:00    9
Freq: 2T, dtype: int64

## 5.1 Expanding Data
---

## 5.2 Splitting
---

## 5.3 Pivot
---

## 5.4 Apply
---

In [358]:
np.random.normal?